<h1><center><font color='midnightblue'> Assignment Of Descriptive Statistics:</font></center></h1>

In [32]:
import pandas as pd
import numpy as np
from collections import Counter as c

<h2><center><font color='blue'> Reading the <font color='darkcyan'>"Salary_Data"</font> csv file:</font></center></h2>

In [33]:
salary_data = pd.read_csv('Salary_Data.csv')
salary_data

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872

<h2><center><font color='blue'> Calculating the mean:</font></center></h2>

In [34]:
def salary_data_mean() :
    print("The mean of YearsExperience: ", np.mean(salary_data['YearsExperience']))
    print("The mean of Salary: ", np.mean(salary_data['Salary']))

In [35]:
salary_data_mean()

The mean of YearsExperience:  5.3133333333333335
The mean of Salary:  76003.0

<h2><center><font color='blue'> Calculating the median:</font></center></h2>

In [36]:
def salary_data_median() :
    print("The median of YearsExperience: ", np.median(salary_data['YearsExperience']))
    print("The median of Salary: ", np.median(salary_data['Salary']))

In [37]:
salary_data_median()

The median of YearsExperience:  4.7
The median of Salary:  65237.0

<h2><center><font color='blue'> Calculating the mode:</font></center></h2>

In [38]:
def salary_data_mode() :
    counter = c(salary_data)
    mode = counter.most_common()
    print("The mode of YearsExperience: ", mode[0][1])
    print("The mode of Salary: ", mode[1][1])

In [39]:
salary_data_mode()

The mode of YearsExperience:  1
The mode of Salary:  1

<h2><center><font color='blue'> Calculating the standard deviation:</font></center></h2>

In [40]:
def salary_data_std() :
    print("The standard deviation of YearsExperience: ", np.std(salary_data['YearsExperience']))
    print("The standard deviation of Salary: ", np.std(salary_data['Salary']))

In [41]:
salary_data_std()

The standard deviation of YearsExperience:  2.790189161249745
The standard deviation of Salary:  26953.65024877583

<h2><center><font color='blue'> Calculating the correlation coefficient:</font></center></h2>

In [42]:
def salary_data_corrcoef() :
    print("The correlation coefficient of YearsExperience: ", np.corrcoef(salary_data['YearsExperience']))
    print("The correlation coefficient of Salary: ", np.corrcoef(salary_data['Salary']))

In [43]:
salary_data_corrcoef()

The correlation coefficient of YearsExperience:  1.0
The correlation coefficient of Salary:  1.0

<h2><center><font color='crimson'> Extra:</font></center></h2>

<h2><center><font color='limegreen'> If you want to view the describtion of the file:</font></center></h2>

In [44]:
salary_data.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

<h2><center><font color='limegreen'> If you want to view the first 10 rows of the file:</font></center></h2>

In [45]:
salary_data.head(10)

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891
5              2.9   56642
6              3.0   60150
7              3.2   54445
8              3.2   64445
9              3.7   57189

<h2><center><font color='limegreen'> If you want to know the number of rows and coloumns of the file:</font></center></h2>

In [46]:
salary_data.shape

(30, 2)